BANNED = """Уважаемый пользователь!

Настоящим сообщаем Вам, что Ваш аккаунт не подключен к информационной системе информационно-коммуникационной сети «Интернет» (далее — Интернет) «Телеграм-бот для управления и развития развлекательной инфраструктуры (далее — Инфраструктуры) публичного канала «ш₽шηшη» (далее — Канал) и привязанного к нему текстово-визуального средства обмена сообщениями «обсуждаем ш₽шηшη» (далее — Чат) в социальной сети — средстве обмена мгновенными сообщениями «Телеграм» (далее — Телеграм)» (далее — Бот). На основании указанных фактов, а также статьи 421 Гражданского кодекса Российской Федерации, в использовании бота Вам отказано.

Если Вы уже отправляли заявку на подключение к Боту в течение 30 (тридцати) календарных дней, то Вы ничего не делайте. Если по Вашей заявке уже было дано заключение, напишите заявление о несогласии с принятым решением в произвольной форме, указав обстоятельства и причины произошедшего, после чего отправьте её заказным письмом по адресу: mvv@а-р-с-и-б.рф.

ДОКУМЕНТ ПОДПИСАН ЭЛЕКТРОННОЙ ПОДПИСЬЮ"""

REQUESTED = """Уважаемый пользователь!

Настоящим сообщаем Вам, что Ваш аккаунт не подключен к информационной системе информационно-коммуникационной сети «Интернет» (далее — Интернет) «Телеграм-бот для управления и развития развлекательной инфраструктуры (далее — Инфраструктуры) публичного канала «ш₽шηшη» (далее — Канал) и привязанного к нему текстово-визуального средства обмена сообщениями «обсуждаем ш₽шηшη» (далее — Чат) в социальной сети — средстве обмена мгновенными сообщениями «Телеграм» (далее — Телеграм)» (далее — Бот). На основании указанных фактов, Регламента использования ИС Бот, а также статьи 421 Гражданского кодекса Российской Федерации, для использования бота Вам необходимо составить заявку.

Используя ИС Бот, Вы соглашаетесь с едиными правилами ИС Бот, Чата и Канала, политикой конфиденциальности, даёте согласие на обработку Ваших персональных данных в Телеграм, а также выражаете своё согласие на дистанционное (электронное) участие во всероссийском голосовании за поправки в Конституцию Российской Федерации, которое пройдёт 1 июля 2020 года.

Благодаря применению российских лидирующих технологий в Москве, заявка уже была составлена в автоматическом режиме и отправлена на рассмотрение Администрации ИС Бот. Ваш номер в очереди — –1. Администрация ИС Бот сообщит Вам о результате рассмотрения заявки в течение 30 (тридцати) рабочих дней."""

DECLINED = """Уважаемый пользователь!

Настоящим сообщаем Вам, что Ваш аккаунт не подключен к информационной системе информационно-коммуникационной сети «Интернет» (далее — Интернет) «Телеграм-бот для управления и развития развлекательной инфраструктуры (далее — Инфраструктуры) публичного канала «ш₽шηшη» (далее — Канал) и привязанного к нему текстово-визуального средства обмена сообщениями «обсуждаем ш₽шηшη» (далее — Чат) в социальной сети — средстве обмена мгновенными сообщениями «Телеграм» (далее — Телеграм)» (далее — Бот). На основании указанных фактов, Регламента использования ИС Бот, а также статьи 421 Гражданского кодекса Российской Федерации, администрация ИС Бот рассмотрела Вашу заявку на использование ИС Бот, по результатам чего Вам было отказано.

Вы вправе обратиться с заявлением о несогласии с принятым решением к Администрации ИС Бот, которая, в свою очередь, вправе повторно Вам отказать.

ДОКУМЕНТ ПОДПИСАН ЭЛЕКТРОННОЙ ПОДПИСЬЮ"""

APPROVED = """Уважаемый пользователь!

Администрация ИС Бот согласовала использование Вами ИС Бот. Таким образом, Вы можете приступить к использованию ИС Бот следующим образом:

1. Отправьте изображение в ИС Бот. Не изображения НЕ отправляйте. В том числе запрещается отправлять файлы, информацию, распространение которой на территории РФ запрещено и аниме.

2. В подписи к изображению может быть на усмотрение Вас прикреплено не менее 2 (двух) и не более 2 (двух) символов категории «Пиктограммы Японии 300» (от англ. Emoji). Таким образом, первый символ категории будет прикреплен в виде левой кнопки для голосования, а второй — в виде правой кнопки. При отсутствии подписи будет использоваться 📈 и 📉 соответственно.

3. Нажатие иным Пользователем на левую кнопку приводит к увеличению Вашего социального рейтинга. Нажатие иным Пользователем на правую кнопку приводит к уменьшению Вашего социального рейтинга. Попытки дискредитировать мнение пользователей ради увеличения социального рейтинга приведут к расторжению Договора.

4. Публикуйте картинки, увеличивайте Ваш социальный рейтинг и развивайтесь вместе с «ш₽шηшη»!

5. Все вопросы и предложения адресуйте Администрации ИС Бот посредством Чата «обсуждаем ш₽шηшη»"""

REQUEST = """Уважаемый Председатель Правления «ш₽шηшη»!

Предлагаем Вашему вниманию заявку на присоединение к ИС Бот.

Данные о пользователе:
<a href="tg://user?id={user.id}">{user.first_name} {user.last_name}</a> @{user.username}.

Уникальный идентификатор: {user.id}.

В целях рассмотрения заявки на присоединение к ИС Бот, выберите документ с Вашей резолюцией для его подписания Вашей неквалифицированной электронной цифровой подписью из нижеприведённых:."""

POSTED = """Администрация ИС Бот выражает Вам благодарность за пост! Ознакомьтесь с Вашим постом, используя унифицированный локационный интерфейс: https://t.me/c/1227113303/{post.message_id}"""